mrkopz/tamaclaude/firmware/sdkconfig.defaults
# ESP32-D0WD-V3, 4MB flash, ไม่มี PSRAM
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# BLE เท่านั้น — NimBLE เล็กกว่า Bluedroid และเราต้องการแค่ peripheral
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY_LEGACY_ADV=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# snapshot ต้องเข้าได้ในการเขียนครั้งเดียว — daemon ตัดข้อความให้พอดี 500 ไบต์แล้ว
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
# รหัส WiFi เดินผ่าน config characteristic ซึ่งประกาศ WRITE_ENC ไว้ — ไม่มี SM แล้ว
# การเขียนนั้นถูกปฏิเสธทุกครั้ง และ bond ต้องอยู่ใน NVS ไม่งั้นรีบูตทีจับคู่ใหม่ที
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# WiFi station สำหรับทางเดินที่สองของ snapshot — วิทยุตัวเดียวกับ BLE จึงต้อง coexist
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
# บอร์ดนี้ไม่มี PSRAM และ LVGL ถือ buffer อยู่ 30KB แล้ว — บัฟเฟอร์ WiFi ชุดเต็ม
# (10 static rx / 32 dynamic rx) กินอีกเกือบ 60KB ซึ่งไม่มีให้ และเราส่ง snapshot
# 500 ไบต์ทุกไม่กี่วินาที ไม่ใช่สตรีมวิดีโอ
# WiFi ย้ายโค้ดร้อนของตัวเองเข้า IRAM โดยปริยาย แต่ IRAM ของ ESP32 มีก้อนเดียวและ
# BLE controller จองไปแล้วเกือบหมด — ปิดสองสวิตช์นี้ ไม่งั้นลิงก์ไม่ผ่าน (`iram0_0_seg
# overflowed`) ราคาคือ throughput ของ WiFi ซึ่งเราใช้ส่ง 500 ไบต์ทุกไม่กี่วินาที
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=12
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=12

# LVGL v9
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_SIZE_KILOBYTES=48
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
# 48 ยังต้องอยู่ ถึงราคาบนการ์ด watchlist จะเลิกใช้แล้ว — นาฬิกาหน้ามาสคอต อุณหภูมิ
# หน้าอากาศ และวันที่หน้าปฏิทิน ยังใช้ตัวนี้อยู่
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_USE_LOG=n
CONFIG_LV_USE_OBSERVER=n
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_KEYBOARD=n
# ปิด textarea ไม่ได้ — spinbox ใน LVGL 9.2 พึ่งมันแบบ #error ไม่ใช่แค่คอมไพล์ไม่ผ่าน
CONFIG_LV_USE_TABLE=n
CONFIG_LV_USE_SPAN=n

# งานวาดจอกินเวลานาน ให้ main task มี stack พอ
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
